Catalogs/DMS_КарточкиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_КарточкиКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыКарточекКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_УсловияПоКарточкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекретныйКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОформления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТоплива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДилера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКогда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантииРасширенная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DMS_КарточкиКлиентов/Ext/ManagerModule.bsl
Функция ВернутьАдрес(Объект) Экспорт;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	ВыборкаАдресов =  Запрос.Выполнить().Выбрать();
	Адрес= " Адрес регистрации не указан";	
	Если ВыборкаАдресов.Следующий() тогда
		Адрес = ВыборкаАдресов.Представление;	
	иначе
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		ВыборкаАдресов =  Запрос.Выполнить().Выбрать();
		Если ВыборкаАдресов.Следующий() тогда
			Адрес = ВыборкаАдресов.Представление;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Адрес;
КонецФункции

Функция ВернутьТелефон(Объект) экспорт
	Возврат DMS_ОбращенияКлиентов.ПолучитьТелефонОбъекта(Объект);
КонецФункции

Функция ВернутьДокументКлиента(Клиент) экспорт
	
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
	|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК Вид,
	|	ПодтверждающиеДокументы.КемВыдан
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Владелец
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидДок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи УБЫВ";
	
	Запрос.УстановитьПараметр("Владелец", Клиент);
	Запрос.УстановитьПараметр("ВидДок",	Перечисления.ВидыДокументов.Паспорт);
	
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	Документ = "Документ на заполнен";
	Если ВыборкаДокументов.Следующий() тогда
		Документ = Строка(ВыборкаДокументов.Вид) + ", Серия " + ВыборкаДокументов.Серия+ " №"+ВыборкаДокументов.Номер+ " Выдан: " +ВыборкаДокументов.КемВыдан+ " "+Строка(Формат(ВыборкаДокументов.ДатаВыдачи,"ДФ=dd.MM.yyyy"));
	Иначе
		Запрос.УстановитьПараметр("ВидДок",	Перечисления.ВидыДокументов.Удостоверение);
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		Если ВыборкаДокументов.Следующий() тогда
			Документ = Строка(ВыборкаДокументов.Вид) + ", Серия " + ВыборкаДокументов.Серия+ " №"+ВыборкаДокументов.Номер+ " Выдано: " +ВыборкаДокументов.КемВыдан+ " "+Строка(ВыборкаДокументов.ДатаВыдачи);
		КонецЕсли;
	КонецЕсли;
	
Возврат Документ;
	
КонецФункции

Функция СобратьДанныеДляПечати(Ссылка)
	
	Документ = ВернутьДокументКлиента(Ссылка.Клиент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр.Организация КАК Организация,
	|	СведенияКомпанииСрезПоследних.Значение КАК Руководитель,
	|	СведенияКомпанииСрезПоследних.Значение.Должность КАК Должность,
	|	СведенияКомпанииСрезПоследних.Организация.НаименованиеПолное КАК НаименованиеПолное,
	|	СведенияКомпанииСрезПоследних.Организация.ИНН КАК ИНН,
	|	СведенияКомпанииСрезПоследних.Организация.КПП КАК КПП,
	|	СведенияКомпанииСрезПоследних.Организация.ОсновнойБанковскийСчет.Банк КАК Банк,
	|	СведенияКомпанииСрезПоследних.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	СведенияКомпанииСрезПоследних.Организация.ОсновнойБанковскийСчет.Банк.Код КАК БИК
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияКомпании.СрезПоследних(, Объект = &Вид) КАК СведенияКомпанииСрезПоследних
	|		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр.Организация = СведенияКомпанииСрезПоследних.Организация
	|ГДЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыОбъектовСведений.Руководитель);
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
	ВыборкаОрг = Запрос.Выполнить().Выбрать();
	
	Организация  = "";
	ОрганизацияПолное  = "";
	ФИОДиректораПолное ="";
	ДолжностьРуководителя ="";
	ФИОДиректора = "";
	Если ВыборкаОрг.Следующий() Тогда
		Организация  = ВыборкаОрг.Организация;
		ОрганизацияПолное  = ВыборкаОрг.НаименованиеПолное;
		ФИОДиректораПолное = СокрЛП(ВыборкаОрг.Руководитель);
		ДолжностьРуководителя  = ВыборкаОрг.Должность;
		
		Фамилия = Лев(ФИОДиректораПолное, Найти(ФИОДиректораПолное," ")-1 );
		Имя = Прав(ФИОДиректораПолное, СтрДлина(ФИОДиректораПолное) - Найти(ФИОДиректораПолное," "));
		Отчество = Прав(Имя, СтрДлина(Имя) - Найти(Имя," "));
		Имя = Лев(Имя,Найти(Имя," ")-1);
		ФИОДиректора = Фамилия + " "+ Лев(Имя,1)+"."+Лев(Отчество,1)+".";
		
		Банк= ВыборкаОрг.Банк;
		НомерСчета=ВыборкаОрг.НомерСчета;
		БИК=ВыборкаОрг.БИК;
		ИНН=ВыборкаОрг.ИНН;
		КПП=ВыборкаОрг.КПП;
		
	КонецЕсли;
	
	Попытка
		// Загружаем внешнюю компоненту
		ПодключитьВнешнююКомпоненту("ОбщийМакет.DMS_КомпонентаСклоненияФИО", "Decl", ТипВнешнейКомпоненты.Native);
		КомпонентаСклоненияФИО = Новый("AddIn.Decl.CNameDecl");
		СообщениеОбОшибке = "";
		Если Не ПросклонятьФамилиюИмяОтчество(КомпонентаСклоненияФИО, Фамилия, Имя, Отчество, 2,Перечисления.ПолФизическихЛиц.Мужской, ФИОДиректораПолное, СообщениеОбОшибке) Тогда
			Сообщить(СообщениеОбОшибке);
		КонецЕсли;
		
		Если Не ПросклонятьФамилиюИмяОтчество(КомпонентаСклоненияФИО, Фамилия,  Лев(Имя,1), Лев(Отчество,1), 2,Перечисления.ПолФизическихЛиц.Мужской, ФИОДиректора, СообщениеОбОшибке) Тогда
			Сообщить(СообщениеОбОшибке);
			Сообщить("Не удалось просклонять руководителя");
		КонецЕсли;
		
		Если Не Просклонять(КомпонентаСклоненияФИО, ДолжностьРуководителя, 2, Перечисления.ПолФизическихЛиц.Мужской, ДолжностьРуководителя) Тогда
			Сообщить("Не удалось просклонять должность руководителя");
		КонецЕсли;
		
	Исключение
	// Не удалось выполнить операции с внешней компонентой
		Сообщить("Ошибка загрузки внешней компоненты для склонения ФИО! Функции склонения будут недоступны!");
	КонецПопытки;
	
	ГодРождения = ?(ЗначениеЗаполнено(Ссылка.Клиент.ДатаРождения),Строка(Год(Ссылка.Клиент.ДатаРождения)) + " гр.", "");
    
	СтоимостьСтрокой = Строка(Ссылка.УсловияПоКарте.Цена) + " ("+обЧислоПрописью(Ссылка.УсловияПоКарте.Цена,Справочники.Валюты.НайтиПоКоду("643"))+ ") включая НДС в размере " +Строка(Ссылка.УсловияПоКарте.НДС)+ " руб.";
	
	ОграничениеПоСроку = ?(Ссылка.УсловияПоКарте.ОграничениеПоСроку = 0,"",
	Строка(Ссылка.УсловияПоКарте.ОграничениеПоСроку) + " (" + СокрЛП(СтрЗаменить(обЧислоПрописью(Ссылка.УсловияПоКарте.ОграничениеПоСроку*12)," 00 ",""))+") месяцев");
	
	ФорматнаяСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "месяц, месяца, месяцев,м";
	ОграничениеПоСрокуРод= Строка(Ссылка.УсловияПоКарте.ОграничениеПоСроку*12) + " месяцев";	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НомерДоговора",Ссылка.Наименование);
	СтруктураДанных.Вставить("НашаОрганизация",ОрганизацияПолное);
	СтруктураДанных.Вставить("НашаОрганизацияСокр",Организация.Наименование);
	СтруктураДанных.Вставить("ФИОДиректораПолное",ФИОДиректораПолное);
	СтруктураДанных.Вставить("ФИОДиректора",ФИОДиректора);
	СтруктураДанных.Вставить("ДолжностьРуководителя",ДолжностьРуководителя);
	СтруктураДанных.Вставить("КлиентНаименование",Ссылка.Клиент.Наименование);
	СтруктураДанных.Вставить("Документ",Документ);
	СтруктураДанных.Вставить("АдресРегистрации",ВернутьАдрес(Ссылка.Клиент));
	СтруктураДанных.Вставить("ГодРождения",ГодРождения);
	СтруктураДанных.Вставить("ДатаОформления",Строка(Формат(Ссылка.ДатаОформления,"ДФ=dd.MM.yyyy")));
	СтруктураДанных.Вставить("НомерКарты",Ссылка.НомерКарты);
	СтруктураДанных.Вставить("ТипКарты  ",Ссылка.ВидКарты);
	СтруктураДанных.Вставить("МодельАвто",Ссылка.Автомобиль.Модель.Наименование);
	СтруктураДанных.Вставить("VIN",Ссылка.Автомобиль.VIN);
	СтруктураДанных.Вставить("Стоимость",Строка(Ссылка.УсловияПоКарте.Цена));
	СтруктураДанных.Вставить("НДС",Строка(Ссылка.УсловияПоКарте.НДС));
	
	СтруктураДанных.Вставить("СтоимостьСтрокой",СтоимостьСтрокой); 	//!!!12900,00 руб. (двенадцать тысяч девятьсот рублей 00 копеек)  включая НДС (18%) в размере 1967,80 руб
	СтруктураДанных.Вставить("ОграничениеПоПробегу",?(Ссылка.УсловияПоКарте.ОграничениеПоПробегу = 0,"",Строка(Ссылка.УсловияПоКарте.ОграничениеПоПробегу)+ " км."));
	СтруктураДанных.Вставить("ОграничениеПоСроку",ОграничениеПоСроку);
	СтруктураДанных.Вставить("ОграничениеПоСрокуРод",ОграничениеПоСрокуРод);
	СтруктураДанных.Вставить("ДатаОкончания",Формат(Ссылка.ДатаОкончания,"ДФ=dd.MM.yyyy"));
	СтруктураДанных.Вставить("ТелефонКлиента",ВернутьТелефон(Ссылка.Клиент)); //!!!
	СтруктураДанных.Вставить("АдресОрганизации",ВернутьАдрес(Организация));
	СтруктураДанных.Вставить("ИННКПП",СокрЛП(ИНН)+"/"+СокрЛп(КПП));
	СтруктураДанных.Вставить("РасчетныйСчет",НомерСчета);
	СтруктураДанных.Вставить("Банк",Банк);
	СтруктураДанных.Вставить("БИК",БИК);
	СтруктураДанных.Вставить("ТелефонОрганизации",ВернутьТелефон(Организация));
	
	Возврат СтруктураДанных;
	
КонецФункции	

Процедура ПечатьАктУпр(ТабДок, Ссылка) Экспорт
	
	Ссылка = Ссылка.Получить(0);
	
	Макет = Renault_УправлениеПечатью.ПолучитьМакет("Справочник.DMS_КарточкиКлиентов.Акт передачи");//Справочники.DMS_КарточкиКлиентов.ПолучитьМакет("ПечатьУпр");
	
	ТабДок.Очистить();
	Область = Макет.ПолучитьОбласть("Колонка");
	
	Область.Параметры.Заполнить(СобратьДанныеДляПечати(Ссылка));
	
	ТабДок.Вывести(Область);
	
КонецПроцедуры

Процедура ПечатьДоговорУпр(ТабДок, Ссылка) Экспорт
	
	Ссылка = Ссылка.Получить(0);
	
	Если Ссылка.ВидКарты = Справочники.DMS_ВидыКарточекКлиента.ПродленнаяГарантия тогда
		Макет = Renault_УправлениеПечатью.ПолучитьМакет("Справочник.DMS_КарточкиКлиентов.Договор продленная гарантия");
	ИначеЕсли Ссылка.ВидКарты = Справочники.DMS_ВидыКарточекКлиента.SARA тогда
		Макет = Renault_УправлениеПечатью.ПолучитьМакет("Справочник.DMS_КарточкиКлиентов.Договор SARA");
	Иначе 
		Возврат;
	КонецЕсли;
	
	ТабДок.Очистить();
	Область = Макет.ПолучитьОбласть("Колонка");
	
	Область.Параметры.Заполнить(СобратьДанныеДляПечати(Ссылка));
	
	ТабДок.Вывести(Область);
	
КонецПроцедуры

Функция ПросклонятьФамилиюИмяОтчество(Компонента, Знач Фамилия = "", Знач Имя = "", Знач Отчество = "", Падеж = 1, Пол = Неопределено, Результат = "", СообщениеОбОшибке = "") Экспорт
	
	Если Компонента = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФамилияНовая	= Фамилия;
	ИмяНовое		= Имя;
	ОтчествоНовое	= Отчество;
	
	Результат = Фамилия + " " + Имя + " " + Отчество;
	
	// Двойные и тройные ФИО, если указаны с пробелами, исправим на использование дефиса
	НужноИсправитьФамилию	= Найти(Фамилия, " ") > 0;
	НужноИсправитьИмя		= Найти(Имя, " ") > 0;
	НужноИсправитьОтчество	= Найти(Отчество, " ") > 0;
	Если НужноИсправитьФамилию Тогда
		ФамилияНовая = СтрЗаменить(Фамилия, " ", "-");
	КонецЕсли;
	Если НужноИсправитьИмя Тогда
		ИмяНовое = СтрЗаменить(Имя, " ", "-");
	КонецЕсли;
	Если НужноИсправитьОтчество Тогда
		ОтчествоНовое = СтрЗаменить(Отчество, " ", "-");
	КонецЕсли;
	
	ФИО = ФамилияНовая + " " + ИмяНовое + " " + ОтчествоНовое;
	
	Если ПустаяСтрока(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО не должна быть пустая.";
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ФИОНаписаноПоРусски(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО должна состоять только из букв русского алфавита, пробелов и дефисов.";
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ФИО, " ") > 3 Тогда
		СообщениеОбОшибке = "Фамилия, имя и отчество должны разделяться пробелами. Внутри фамилии, имени, отчества пробелов быть не должно.";
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 1);
				
		ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 2);
				
		Иначе
			Результат = Компонента.Просклонять(ФИО, Падеж);
				
		КонецЕсли;
		
		// Вернем пробелы в составные ФИО обратно, если до этого их изменили
		Если НужноИсправитьФамилию ИЛИ НужноИсправитьИмя ИЛИ НужноИсправитьОтчество Тогда
			
			МассивФИО = РазложитьСтрокуВМассивПодстрок(Результат, " ");
			
			Результат = "";
			
			ИндексФИО = 0;
			
			Если Не ПустаяСтрока(Фамилия) Тогда
				ФамилияНовая = МассивФИО[ИндексФИО];
				ИндексФИО = ИндексФИО + 1;
				
				Если НужноИсправитьФамилию Тогда
					
					Если СтрЧислоВхождений(Фамилия, "-") > 0 Тогда
						
						МассивФамилия = РазложитьСтрокуВМассивПодстрок(ФамилияНовая, "-");
						ФамилияНовая = МассивФамилия[0];
						ИндексФамилия = 1;
						
						Пока Истина Цикл
							
							ПозПробел = Найти(Фамилия, " ");
							ПозДефис  = Найти(Фамилия, "-");
							
							Если ПозПробел = ПозДефис Тогда
								Прервать;
							КонецЕсли;
							
							Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
								ФамилияНовая = ФамилияНовая + " ";
								Фамилия = Сред(Фамилия, ПозПробел+1);
								
							ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
								ФамилияНовая = ФамилияНовая + "-";
								Фамилия = Сред(Фамилия, ПозДефис+1);
								
							КонецЕсли;
							
							ФамилияНовая = ФамилияНовая + МассивФамилия[ИндексФамилия];
							ИндексФамилия = ИндексФамилия + 1;
							
						КонецЦикла;
						
					Иначе
						ФамилияНовая = СтрЗаменить(ФамилияНовая, "-", " ");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Результат = Результат + ФамилияНовая;
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(Имя) Тогда
				ИмяНовое = МассивФИО[ИндексФИО];
				ИндексФИО = ИндексФИО + 1;
				
				Если НужноИсправитьИмя Тогда
					
					Если СтрЧислоВхождений(Имя, "-") > 0 Тогда
						
						МассивИмя = РазложитьСтрокуВМассивПодстрок(ИмяНовое, "-");
						ИмяНовое = МассивИмя[0];
						ИндексИмя = 1;
						
						Пока Истина Цикл
							
							ПозПробел = Найти(Имя, " ");
							ПозДефис  = Найти(Имя, "-");
							
							Если ПозПробел = ПозДефис Тогда
								Прервать;
							КонецЕсли;
							
							Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
								ИмяНовое = ИмяНовое + " ";
								Имя = Сред(Имя, ПозПробел+1);
								
							ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
								ИмяНовое = ИмяНовое + "-";
								Имя = Сред(Имя, ПозДефис+1);
								
							КонецЕсли;
							
							ИмяНовое = ИмяНовое + МассивИмя[ИндексИмя];
							ИндексИмя = ИндексИмя + 1;
							
						КонецЦикла;
						
					Иначе
						ИмяНовое = СтрЗаменить(ИмяНовое, "-", " ");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Результат = СокрЛП(Результат + " " + ИмяНовое);
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(Отчество) Тогда
				ОтчествоНовое = МассивФИО[ИндексФИО];
				ИндексФИО = ИндексФИО + 1;
				
				Если НужноИсправитьОтчество Тогда
					
					Если СтрЧислоВхождений(Отчество, "-") > 0 Тогда
						
						МассивОтчество = РазложитьСтрокуВМассивПодстрок(ОтчествоНовое, "-");
						ОтчествоНовое = МассивОтчество[0];
						ИндексОтчество = 1;
						
						Пока Истина Цикл
							
							ПозПробел = Найти(Отчество, " ");
							ПозДефис  = Найти(Отчество, "-");
							
							Если ПозПробел = ПозДефис Тогда
								Прервать;
							КонецЕсли;
							
							Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
								ОтчествоНовое = ОтчествоНовое + " ";
								Отчество = Сред(Отчество, ПозПробел+1);
								
							ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
								ОтчествоНовое = ОтчествоНовое + "-";
								Отчество = Сред(Отчество, ПозДефис+1);
								
							Иначе
								Прервать;
								
							КонецЕсли;
							
							ОтчествоНовое = ОтчествоНовое + МассивОтчество[ИндексОтчество];
							ИндексОтчество = ИндексОтчество + 1;
							
						КонецЦикла;
						
					Иначе
						ОтчествоНовое = СтрЗаменить(ОтчествоНовое, "-", " ");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Результат = СокрЛП(Результат + " " + ОтчествоНовое);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции // ПросклонятьФИО()

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция Просклонять(Компонента, Знач Фраза = "", Падеж = 1, Пол = Неопределено, Результат) Экспорт
	
	Если Компонента = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = "";
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(Фраза, " ");
	
	// Выделим первые 3 слова, так как компонента не умеет склонять фразу большую 3х символов
	НомерНесклоняемогоСимвола = 4;
	Для Номер = 1 По Мин(МассивСтрок.Количество(), 3) Цикл
		//Если Не ФИОНаписаноВерно(МассивСтрок[Номер-1], Истина) Тогда
		//	НомерНесклоняемогоСимвола = Номер;
		//	Прервать;
		//КонецЕсли;

		Результат = Результат + ?(Номер > 1, " ", "") + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = Фраза;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			Результат = Компонента.Просклонять(Результат, Падеж, 1) + " ";
			
		ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
			Результат = Компонента.Просклонять(Результат, Падеж, 2) + " ";
			
		Иначе
			Результат = Компонента.Просклонять(Результат, Падеж) + " ";
			
		КонецЕсли;
		
	Исключение
		Результат = Фраза;
		Возврат Ложь;
		
	КонецПопытки;
	
	// Остальные символы добавим без склонения
	Для Номер = НомерНесклоняемогоСимвола По МассивСтрок.Количество() Цикл
		Результат = Результат + " " + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Истина;
	
КонецФункции // Просклонять()

// Проверяет корректность заполнения Ф.И.О. по использованным символам
//
// Параметры
//  СтрокаПараметр  - Строка - проверяемые фамилия, имя и отчество
//  ПроверятьТолькоРусскиеБуквы  - Булево - исключить из множества допустимых символов
//                                          буквы латинского алфавита
//
// Возвращаемое значение:
//   Число   - 0, когда использован недопустимый символ
//             1, когда все символы корректны
//
Функция ФИОНаписаноВерно(Знач СтрокаПараметр, ПроверятьТолькоРусскиеБуквы = Ложь) Экспорт
	
	СтрокаПараметр = СокрЛП(СтрокаПараметр);
	
	СписокДопустимыхЗначений = Новый Соответствие;
	СписокДопустимыхЗначений.Вставить(КодСимвола(" "), " ");
	СписокДопустимыхЗначений.Вставить(КодСимвола("."), ".");
	СписокДопустимыхЗначений.Вставить(КодСимвола("-"), "-");
	СписокДопустимыхЗначений.Вставить(КодСимвола("ё"), "ё"); // отход от стандарта обусловлен читаемостью кода
	СписокДопустимыхЗначений.Вставить(КодСимвола("Ё"), "Ё"); // отход от стандарта обусловлен читаемостью кода
	
	КодA = КодСимвола("A");
	КодZ = КодСимвола("z");
	КодА = КодСимвола("А");
	КодЯ = КодСимвола("я");
	
	Если ПроверятьТолькоРусскиеБуквы Тогда
		Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
			Код = КодСимвола(СтрокаПараметр, Сч);
			Если ((Код >= КодА) И (Код <= КодЯ)) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
				Продолжить;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
			Код = КодСимвола(СтрокаПараметр, Сч);
			Если (((Код >= КодA) И (Код <= КодZ)) ИЛИ ((Код >= КодА) И (Код <= КодЯ))) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
				Продолжить;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

Функция ФИОНаписаноПоРусски(Знач СтрокаПараметр)
	
	СтрокаПараметр = СокрЛП(СтрокаПараметр);
	
	СписокДопустимыхЗначений = Новый Соответствие;
	СписокДопустимыхЗначений.Вставить(КодСимвола(" "), " ");
	СписокДопустимыхЗначений.Вставить(КодСимвола("-"), "-");
	СписокДопустимыхЗначений.Вставить(КодСимвола("ё"), "ё");
	СписокДопустимыхЗначений.Вставить(КодСимвола("Ё"), "Ё");
	
	КодА = КодСимвола("А");
	КодЯ = КодСимвола("я");
	
	Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
		
		Код = КодСимвола(СтрокаПараметр, Сч);
		
		Если ((Код >= КодА) И (Код <= КодЯ)) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
			Продолжить;
			
		Иначе
			Возврат 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат 1;
	
КонецФункции // ФИОНаписаноВерно()

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	Возврат Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр, Разделитель);
	
КонецФункции // глРазложить

Функция ЗаписатьПродажуКартыВБазуSQL(КартаКлиента) Экспорт
	
	ИсходящийПараметр = Новый Структура();
	ИсходящийПараметр.Вставить("ОбновитьЗапись",Истина);
	ИсходящийПараметр.Вставить("НомерКарты",КартаКлиента.НомерКарты);
	ИсходящийПараметр.Вставить("СекретныйКодКарты",КартаКлиента.СекретныйКодКарты);
	ИсходящийПараметр.Вставить("login_id",0);
	ИсходящийПараметр.Вставить("dealer_id",КартаКлиента.КодДилера);
	ИсходящийПараметр.Вставить("vin",КартаКлиента.VIN);
	ИсходящийПараметр.Вставить("lname",КартаКлиента.Фамилия);
	ИсходящийПараметр.Вставить("fname",КартаКлиента.Имя);
	ИсходящийПараметр.Вставить("mname",КартаКлиента.Отчество);
	ИсходящийПараметр.Вставить("address",КартаКлиента.АдресРегистрации);
	ИсходящийПараметр.Вставить("pass",КартаКлиента.Документ); 
	ИсходящийПараметр.Вставить("pass_kem",КартаКлиента.ДокументКем); 
	ИсходящийПараметр.Вставить("pass_kogda",КартаКлиента.ДокументКогда); 
	ИсходящийПараметр.Вставить("pass_kod","TEXT"); 
	ИсходящийПараметр.Вставить("birthyear",Формат(КартаКлиента.ГодРождения,"ЧГ="));
	ИсходящийПараметр.Вставить("contract",КартаКлиента.Код);
	ИсходящийПараметр.Вставить("gar_start_date",Формат(КартаКлиента.ДатаНачалаГарантии - дата(1970,1,1,1,0,0), "ЧГ=0"));
	ИсходящийПараметр.Вставить("gar_end_date",Формат(КартаКлиента.ДатаОкончанияГарантии - дата(1970,1,1,1,0,0), "ЧГ=0")); 
	ИсходящийПараметр.Вставить("ext_gar_end_date",Формат(КартаКлиента.ДатаОкончанияГарантииРасширенная - дата(1970,1,1,1,0,0), "ЧГ=0")); 
	ИсходящийПараметр.Вставить("cost",Формат(КартаКлиента.УсловияПоКарте.Цена,"ЧГ=")); 
	ИсходящийПараметр.Вставить("card",КартаКлиента.НомерКарты);
	ИсходящийПараметр.Вставить("contract_date",Формат(КартаКлиента.ДатаОформления - дата(1970,1,1,1,0,0), "ЧГ=0")); 
	ИсходящийПараметр.Вставить("num_contract",КартаКлиента.Наименование);
	ИсходящийПараметр.Вставить("num_act",КартаКлиента.Наименование);
	ИсходящийПараметр.Вставить("run", Формат(КартаКлиента.Пробег,"ЧГ="));
	ИсходящийПараметр.Вставить("fuel",КартаКлиента.ВидТоплива);
	ИсходящийПараметр.Вставить("phone",КартаКлиента.Телефон);
	ИсходящийПараметр.Вставить("email",КартаКлиента.Email);
	ИсходящийПараметр.Вставить("credit",КартаКлиента.Кредит);
	ИсходящийПараметр.Вставить("report_id",0);
	ИсходящийПараметр.Вставить("ppcampaign",0);
	ИсходящийПараметр.Вставить("ppsigma",0);
	ИсходящийПараметр.Вставить("ppcheck",0);
	ИсходящийПараметр.Вставить("ppdata",""); 
	ИсходящийПараметр.Вставить("ppcomment",""); 
	ИсходящийПараметр.Вставить("is_VN",1);
	ИсходящийПараметр.Вставить("sf_counter","");
	ИсходящийПараметр.Вставить("sf_link","");
	ИсходящийПараметр.Вставить("alcor_pp_num","");
	ИсходящийПараметр.Вставить("sf_advance","");
	ИсходящийПараметр.Вставить("filename","");
	ИсходящийПараметр.Вставить("type",Число(КартаКлиента.ВидКарты.Код));
	ИсходящийПараметр.Вставить("status",2);
	ИсходящийПараметр.Вставить("tech",0);
	ИсходящийПараметр.Вставить("service",0);
	ИсходящийПараметр.Вставить("service_run",1);
	ИсходящийПараметр.Вставить("communication",1);
	ИсходящийПараметр.Вставить("active",1);
	ИсходящийПараметр.Вставить("parent_id","");
	ИсходящийПараметр.Вставить("id_card_new","");
	ИсходящийПараметр.Вставить("date_modified",Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd hh;mm;ss'"));
	ИсходящийПараметр.Вставить("RenaultSelection",1);
	
	Попытка
	ВебСервис = ПолучитьВебСервис();
	Исключение
		Сообщить("Не удалось соединиться с центральной базой!");
		Сообщить("Ошибка " +ОписаниеОшибки());
		Возврат новый Структура("Ответ,Сообщение",0,"Не удалось соединиться с центральной базой!");
	КонецПопытки;
	Параметр = СериализаторXDTO.ЗаписатьXDTO(ИсходящийПараметр);
 	Сообщение = "";
 	Ответ = ВебСервис.SaleCard(Параметр,Сообщение);
	
	Возврат новый Структура("Ответ,Сообщение",Ответ,Сообщение);
	
КонецФункции

Функция ПолучитьВебСервис() Экспорт 
	
	Возврат DMS_ВзаимодействияСКлиентом.ПолучитьВебСервисКарточки();
	
КонецФункции

Функция НайтиДанныеПоVINАвтомобиля(VIN) Экспорт
	
	Сообщение = "";
	
	Попытка
		ВебСервис = ПолучитьВебСервис();
		Ответ = ВебСервис.CheckExistingDataVIN(VIN,Сообщение);
		
		Сериал = новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
		Таблица = Сериал.ПрочитатьXDTO(Ответ);
		
	Исключение
		Сообщить("Не удалось соединиться с центральной базой!");
		Сообщить("Ошибка " +ОписаниеОшибки());
		Возврат Новый ТаблицаЗначений;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Таблица) Тогда
		
		НоваяТаблица = Новый ТаблицаЗначений;
		НоваяТаблица.Колонки.Добавить("ВидКарты");  //Строка(type) ВидКарты.Код
		НоваяТаблица.Колонки.Добавить("Фамилия"); //lname
		НоваяТаблица.Колонки.Добавить("Имя"); //fname
		НоваяТаблица.Колонки.Добавить("Отчество"); //mname
		НоваяТаблица.Колонки.Добавить("VIN"); 
		НоваяТаблица.Колонки.Добавить("Цена");  //cost
		НоваяТаблица.Колонки.Добавить("ДатаНачалаГарантии");
		НоваяТаблица.Колонки.Добавить("ДатаОкончанияГарантии");
		НоваяТаблица.Колонки.Добавить("ДатаОкончанияГарантииРасширенная");
		НоваяТаблица.Колонки.Добавить("ДатаОформления");  //contract_date
		НоваяТаблица.Колонки.Добавить("BIR");
		НоваяТаблица.Колонки.Добавить("ДатаКонтракта");
		НоваяТаблица.Колонки.Добавить("ПробегПриЗаключенииКонтракта");
		НоваяТаблица.Колонки.Добавить("СекретныйКодКарты"); //code
		НоваяТаблица.Колонки.Добавить("КодДилера"); //dealer_id
		НоваяТаблица.Колонки.Добавить("АдресРегистрации"); //address
		НоваяТаблица.Колонки.Добавить("Документ");  //pass
		НоваяТаблица.Колонки.Добавить("ДокументКем");  //pass_kem
		НоваяТаблица.Колонки.Добавить("ДокументКогда",);  //pass_kogda
		НоваяТаблица.Колонки.Добавить("ГодРождения"); //birthyear
		НоваяТаблица.Колонки.Добавить("Код"); //contract
		НоваяТаблица.Колонки.Добавить("НомерКарты"); //card
		НоваяТаблица.Колонки.Добавить("Наименование");//num_contract
		НоваяТаблица.Колонки.Добавить("Пробег"); //run
		НоваяТаблица.Колонки.Добавить("ВидТоплива"); //fuel
		НоваяТаблица.Колонки.Добавить("Телефон");  //phone
		НоваяТаблица.Колонки.Добавить("Email");  //email
		НоваяТаблица.Колонки.Добавить("Кредит"); //credit
		НоваяТаблица.Колонки.Добавить("КодМодели"); //credit

			
		Для Каждого Строка ИЗ Таблица Цикл
			
			НоваяСтрока = НоваяТаблица.Добавить();
			
			НоваяСтрока.ДатаНачалаГарантии = МестноеВремя('19700101' + Строка.gar_start_date);
			НоваяСтрока.ДатаОкончанияГарантии =  МестноеВремя('19700101' + Строка.gar_end_date);
			НоваяСтрока.ДатаОкончанияГарантииРасширенная =  МестноеВремя('19700101' + Строка.ext_gar_end_date);
			НоваяСтрока.BIR = Формат(Строка.dealer_bir, "ЧГ=0");
			НоваяСтрока.ДатаКонтракта = МестноеВремя('19700101' + Строка.contract_date);
			новаяСтрока.ПробегПриЗаключенииКонтракта = Строка.run;
			НоваяСтрока.СекретныйКодКарты = Строка.Code;
			НоваяСтрока.КодДилера = СтрЗаменить(Строка(Строка.dealer_id)," ","");
			НоваяСтрока.VIN= Строка.VIN;
			НоваяСтрока.Фамилия = Строка.lname;
			НоваяСтрока.Имя = Строка.fname;
			НоваяСтрока.Отчество = Строка.mname;
			НоваяСтрока.АдресРегистрации = Строка.address;
			НоваяСтрока.Документ = Строка.pass;
			НоваяСтрока.ДокументКем = Строка.pass_kem;
			НоваяСтрока.ДокументКогда = Строка.pass_kogda;
			НоваяСтрока.ГодРождения = Число(Строка.birthyear);
			НоваяСтрока.Код = Строка.Card;
			НоваяСтрока.Цена = Строка.cost;
			НоваяСтрока.НомерКарты = Строка.Card;
			НоваяСтрока.ДатаОформления = МестноеВремя('19700101' + Строка.contract_date);
			НоваяСтрока.Наименование = Строка.num_contract;
			НоваяСтрока.Пробег = Строка.run;
			НоваяСтрока.ВидТоплива = Строка.fuel;
			НоваяСтрока.Телефон = Строка.phone;
			НоваяСтрока.Email = Строка.email;
			НоваяСтрока.Кредит = Строка.credit;
			НоваяСтрока.КодМодели = Строка.model_code;
			НоваяСтрока.ВидКарты = Справочники.DMS_ВидыКарточекКлиента.НайтиПоКоду(Renault_СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(Строка.type), 9,  "0", "Слева"));

		КонецЦикла;
		
		Возврат НоваяТаблица;
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция СоздатьКарточкуКлиента(КартаКлиента) Экспорт
	
	ВебСервис = ПолучитьВебСервис();
	
	НоваяКарта = Справочники.DMS_КарточкиКлиентов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяКарта,КартаКлиента,,"Код");
	НоваяКарта.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",КартаКлиента.VIN);
	НоваяКарта.Клиент = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(НоваяКарта.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_УсловияПоКарточкам.Ссылка
		|ИЗ
		|	Справочник.DMS_УсловияПоКарточкам КАК DMS_УсловияПоКарточкам
		|ГДЕ
		|	DMS_УсловияПоКарточкам.КодМодели = &КодМодели
		|	И DMS_УсловияПоКарточкам.Цена = &Цена";
		
	Запрос.УстановитьПараметр("КодМодели", Число(КартаКлиента.КодМодели));
	Запрос.УстановитьПараметр("Цена", Число(КартаКлиента.Цена));
	
	ВыборкаУсловий = Запрос.Выполнить().Выбрать();
	Если ВыборкаУсловий.Следующий() Тогда	
		НоваяКарта.УсловияПоКарте = ВыборкаУсловий.Ссылка;
	КонецЕсли;
	НоваяКарта.Записать();
	
	Возврат НоваяКарта.Ссылка;
КонецФункции
